/* ==================== Алиасы для импртов js/ts ==================== */
// @  ===  src;
// @a ===  src/assets;
// @b ===  src/blocks;
// @p ===  src/pages;
/* ==================== Алиасы для импртов js/ts ==================== */

/* ==================== process.env ==================== */
// console.log(process.env.APP_URL); ---> console.log('/');
/* ==================== process.env ==================== */

/* ==================== Java Script ==================== */

window.$ = window.jQuery = window.jquery = $;

/* ====================red Assets red ==================== */

import '@a/js/o2.ts';
import '@a/js/cookie.ts';
import '@a/js/validator.js';
import '@a/js/slick.min.js';

/* ====================red Assets red==================== */



/* ====================#1ef Blocks #1ef==================== */

import '@b/g-select/g-select.js';

/* ====================#1ef Blocks #1ef==================== */

import '@b/g-slider/g-slider.js';


/* ====================#fff Pages #fff ==================== */

import '@p/form/form.js';

/* ====================#fff Pages #fff==================== */



/* ==================== Java Script ==================== */
/* ======================================================== */
/* ======================== SCSS ========================== */

import '@a/scss/main.scss';

/* ======================== SCSS ========================== */